weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_Alexa.c
/*
 * STM32_Alexa.c
 *
 *  Created on: Jun 3, 2025
 *      Author: weedm
 */

#include "STM32_Alexa.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

// Configuration
#define ALEXA_MAX_DEVICES 8
#define ALEXA_SSDP_PORT 1900
#define ALEXA_HTTP_PORT 80

// Variables globales
static alexa_device_t g_devices[ALEXA_MAX_DEVICES];
static int g_device_count = 0;
static char g_device_ip[32];

// Prototypes des fonctions internes
static void alexa_handle_ssdp(int conn_id, const http_parsed_request_t *request);
static void alexa_handle_description(int conn_id, const http_parsed_request_t *request);
static void alexa_handle_api(int conn_id, const http_parsed_request_t *request);
static void alexa_handle_lights(int conn_id, const http_parsed_request_t *request);
static void alexa_handle_light_control(int conn_id, const http_parsed_request_t *request);
static void alexa_update_device_state(int device_id, uint8_t state, uint8_t brightness);
static int alexa_find_device_by_id(const char *id);

// Initialisation du module Alexa
void alexa_init(void)
{
	// Récupère l'adresse IP
	esp01_get_current_ip(g_device_ip, sizeof(g_device_ip));

	// Enregistre les routes HTTP
	esp01_add_route("/description.xml", alexa_handle_description);
	esp01_add_route("/api", alexa_handle_api);
	esp01_add_route("/api/", alexa_handle_api);
	esp01_add_route("/api/lights", alexa_handle_lights);
	esp01_add_route("/api/lights/", alexa_handle_lights);
	esp01_add_route("/upnp/discovery", alexa_handle_ssdp);
	esp01_add_route("/upnp/control/basicevent1", alexa_handle_ssdp);
	esp01_add_route("/eventservice.xml", alexa_handle_description);
	esp01_add_route("/setup.xml", alexa_handle_description);

	// Ajout de routes pour les contrôles spécifiques
	esp01_add_route("/api/lights/1/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/2/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/3/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/4/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/5/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/6/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/7/state", alexa_handle_light_control);
	esp01_add_route("/api/lights/8/state", alexa_handle_light_control);

	// Réinitialise le tableau des périphériques
	memset(g_devices, 0, sizeof(g_devices));
	g_device_count = 0;

	alexa_logln("Module initialisé, IP: %s", g_device_ip);

	// Envoyer immédiatement des annonces de découverte
	alexa_handle_discovery();
}

// Ajout d'un périphérique GPIO (ON/OFF)
int alexa_add_gpio_device(const char *name, GPIO_TypeDef *port, uint16_t pin)
{
	if (g_device_count >= ALEXA_MAX_DEVICES)
		return -1;

	int id = g_device_count++;
	alexa_device_t *device = &g_devices[id];

	strncpy(device->name, name, sizeof(device->name) - 1);
	snprintf(device->uniqueid, sizeof(device->uniqueid), "00:17:88:01:00:%02X:%02X:%02X",
			 id, (unsigned)port & 0xFF, pin & 0xFF);

	device->type = ALEXA_DEVICE_ONOFF;
	device->gpio_port = port;
	device->gpio_pin = pin;
	device->state = (HAL_GPIO_ReadPin(port, pin) == GPIO_PIN_SET) ? 1 : 0;
	device->brightness = 255;

	alexa_logln("Périphérique GPIO ajouté: %s (ID: %d)", name, id);
	return id;
}

// Ajout d'un périphérique PWM (variable)
int alexa_add_pwm_device(const char *name, TIM_HandleTypeDef *htim, uint32_t channel)
{
	if (g_device_count >= ALEXA_MAX_DEVICES)
		return -1;

	int id = g_device_count++;
	alexa_device_t *device = &g_devices[id];

	strncpy(device->name, name, sizeof(device->name) - 1);
	snprintf(device->uniqueid, sizeof(device->uniqueid), "00:17:88:01:01:%02X:%02X:%02lX",
			 id, (unsigned)htim & 0xFF, channel & 0xFF);

	device->type = ALEXA_DEVICE_DIMMABLE;
	device->htim = htim;
	device->channel = channel;
	device->state = 0;
	device->brightness = 0;

	alexa_logln("Périphérique PWM ajouté: %s (ID: %d)", name, id);
	return id;
}

// Variables pour la gestion des annonces périodiques
static uint32_t g_last_discovery_time = 0;
#define ALEXA_DISCOVERY_INTERVAL 30000 // 30 secondes

// Traitement des requêtes Alexa
void alexa_process(void)
{
	// Vérifier s'il est temps d'envoyer une nouvelle annonce de découverte
	uint32_t current_time = HAL_GetTick();
	if (current_time - g_last_discovery_time > ALEXA_DISCOVERY_INTERVAL)
	{
		alexa_handle_discovery();
		g_last_discovery_time = current_time;
	}
}

// Gestionnaire pour la description du périphérique
static void alexa_handle_description(int conn_id, const http_parsed_request_t *request)
{
	char response[1024];
	snprintf(response, sizeof(response),
			 "<?xml version=\"1.0\"?>"
			 "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
			 "<specVersion><major>1</major><minor>0</minor></specVersion>"
			 "<URLBase>http://%s:%d/</URLBase>"
			 "<device>"
			 "<deviceType>urn:schemas-upnp-org:device:Basic:1</deviceType>"
			 "<friendlyName>%s</friendlyName>"
			 "<manufacturer>Belkin International Inc.</manufacturer>"
			 "<modelName>Emulated Wemo</modelName>"
			 "<modelNumber>3.1415</modelNumber>"
			 "<UDN>uuid:Socket-1_0-%s</UDN>"
			 "<serviceList>"
			 "<service>"
			 "<serviceType>urn:Belkin:service:basicevent:1</serviceType>"
			 "<serviceId>urn:Belkin:serviceId:basicevent1</serviceId>"
			 "<controlURL>/upnp/control/basicevent1</controlURL>"
			 "<eventSubURL>/upnp/event/basicevent1</eventSubURL>"
			 "<SCPDURL>/eventservice.xml</SCPDURL>"
			 "</service>"
			 "</serviceList>"
			 "</device>"
			 "</root>",
			 g_device_ip, ALEXA_HTTP_PORT,
			 g_devices[0].name,		 // Utilise le nom du premier périphérique
			 g_devices[0].uniqueid); // Utilise l'ID unique du premier périphérique

	esp01_send_http_response(conn_id, 200, "text/xml", response, strlen(response));
	alexa_logln("Description du périphérique envoyée");
}

static void alexa_handle_ssdp(int conn_id, const http_parsed_request_t *request)
{
	alexa_logln("Requête SSDP reçue: %s", request->headers_buf);

	// Vérifier si c'est une requête M-SEARCH
	if (strstr(request->headers_buf, "M-SEARCH") != NULL)
	{
		// Extraire l'adresse IP source et le port de la requête M-SEARCH
		char source_ip[16] = {0};
		uint16_t source_port = 0;

		// Extraire l'IP et le port du client depuis les en-têtes de la requête
		if (request->headers_buf[0] != '\0')
		{
			const char *ip_start = strstr(request->headers_buf, "\"");
			if (ip_start)
			{
				ip_start++; // Sauter le premier guillemet
				const char *ip_end = strstr(ip_start, "\"");
				if (ip_end)
				{
					size_t ip_len = ip_end - ip_start;
					if (ip_len < sizeof(source_ip))
					{
						strncpy(source_ip, ip_start, ip_len);
						source_ip[ip_len] = '\0';

						// Extraire le port
						const char *port_start = strstr(ip_end, ",");
						if (port_start)
						{
							port_start++; // Sauter la virgule
							source_port = atoi(port_start);
						}
					}
				}
			}
		}

		// Si on a réussi à extraire l'IP et le port
		if (source_ip[0] != '\0' && source_port > 0)
		{
			alexa_logln("Envoi réponses M-SEARCH à %s:%d", source_ip, source_port);
			
			char response[512];
			
