weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_Alexa.c
			// Déterminer le type de recherche (ST)
			const char *st_header = strstr(request->headers_buf, "ST:");
			if (!st_header) st_header = strstr(request->headers_buf, "st:");
			
			if (st_header)
			{
				alexa_logln("ST header trouvé: %s", st_header);
				
				// Réponse pour rootdevice
				if (strstr(st_header, "upnp:rootdevice"))
				{
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: upnp:rootdevice\r\n"
							"USN: uuid:Socket-1_0-%s::upnp:rootdevice\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					alexa_logln("Réponse rootdevice envoyée");
				}
				// Réponse pour device
				else if (strstr(st_header, "urn:Belkin:device") || strstr(st_header, "ssdp:all"))
				{
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: urn:Belkin:device:**\r\n"
							"USN: uuid:Socket-1_0-%s::urn:Belkin:device:**\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					alexa_logln("Réponse device envoyée");
				}
				// Réponse pour UUID
				else if (strstr(st_header, "uuid:"))
				{
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: uuid:Socket-1_0-%s\r\n"
							"USN: uuid:Socket-1_0-%s\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					alexa_logln("Réponse UUID envoyée");
				}
				// Réponse pour tout autre type de recherche
				else
				{
					// Envoyer toutes les réponses possibles
					// Réponse rootdevice
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: upnp:rootdevice\r\n"
							"USN: uuid:Socket-1_0-%s::upnp:rootdevice\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					HAL_Delay(20);
					
					// Réponse device
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: urn:Belkin:device:**\r\n"
							"USN: uuid:Socket-1_0-%s::urn:Belkin:device:**\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					HAL_Delay(20);
					
					// Réponse UUID
					snprintf(response, sizeof(response),
							"HTTP/1.1 200 OK\r\n"
							"CACHE-CONTROL: max-age=86400\r\n"
							"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
							"EXT:\r\n"
							"LOCATION: http://%s:%d/description.xml\r\n"
							"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
							"ST: uuid:Socket-1_0-%s\r\n"
							"USN: uuid:Socket-1_0-%s\r\n\r\n",
							g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid, g_devices[0].uniqueid);
					esp01_send_udp(source_ip, source_port, response, strlen(response));
					
					alexa_logln("Toutes les réponses envoyées");
				}
			}
			else
			{
				// Si pas de ST header, envoyer toutes les réponses
				// Réponse rootdevice
				snprintf(response, sizeof(response),
						"HTTP/1.1 200 OK\r\n"
						"CACHE-CONTROL: max-age=86400\r\n"
						"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
						"EXT:\r\n"
						"LOCATION: http://%s:%d/description.xml\r\n"
						"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
						"ST: upnp:rootdevice\r\n"
						"USN: uuid:Socket-1_0-%s::upnp:rootdevice\r\n\r\n",
						g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
				esp01_send_udp(source_ip, source_port, response, strlen(response));
				HAL_Delay(20);
				
				// Réponse device
				snprintf(response, sizeof(response),
						"HTTP/1.1 200 OK\r\n"
						"CACHE-CONTROL: max-age=86400\r\n"
						"DATE: Sat, 01 Jan 2022 00:00:00 GMT\r\n"
						"EXT:\r\n"
						"LOCATION: http://%s:%d/description.xml\r\n"
						"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
						"ST: urn:Belkin:device:**\r\n"
						"USN: uuid:Socket-1_0-%s::urn:Belkin:device:**\r\n\r\n",
						g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
				esp01_send_udp(source_ip, source_port, response, strlen(response));
				HAL_Delay(20);
				
				alexa_logln("Réponses par défaut envoyées");
			}
		}

		// Envoyer aussi une annonce de découverte générale
		alexa_handle_discovery();
	}
	else if (strstr(request->path, "/upnp/control/basicevent1") != NULL)
	{
		// Gérer les requêtes de contrôle UPnP
		esp01_send_http_response(conn_id, 200, "text/xml", 
			"<?xml version=\"1.0\"?>\r\n"
			"<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\r\n"
			"<s:Body>\r\n"
			"<u:SetBinaryStateResponse xmlns:u=\"urn:Belkin:service:basicevent:1\">\r\n"
			"<BinaryState>1</BinaryState>\r\n"
			"</u:SetBinaryStateResponse>\r\n"
			"</s:Body>\r\n"
			"</s:Envelope>\r\n", 290);
		
		alexa_logln("Réponse basicevent envoyée");
	}
	else
	{
		esp01_send_http_response(conn_id, 200, "text/plain", "OK", 2);
	}

