weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_Alexa.c
	alexa_logln("Requête SSDP traitée");
}

// Gestionnaire pour l'API Hue
static void alexa_handle_api(int conn_id, const http_parsed_request_t *request)
{
	alexa_logln("Requête API reçue: %s %s", request->method, request->path);

	// Si c'est une requête POST sur /api (authentification)
	if (strcmp(request->method, "POST") == 0 && strcmp(request->path, "/api") == 0)
	{
		// Simulation d'une authentification réussie
		char response[256];
		snprintf(response, sizeof(response),
				 "[{\"success\":{\"username\":\"STM32AlexaUser\"}}]");

		esp01_send_http_response(conn_id, 200, "application/json", response, strlen(response));
		alexa_logln("Authentification simulée envoyée");
		return;
	}

	// Vérifie si c'est une requête pour les périphériques
	if (strstr(request->path, "/api/lights"))
	{
		alexa_handle_lights(conn_id, request);
		return;
	}

	// Réponse par défaut (liste des périphériques)
	char response[1024];
	char *ptr = response;
	ptr += sprintf(ptr, "{\"lights\":{");

	for (int i = 0; i < g_device_count; i++)
	{
		ptr += sprintf(ptr, "\"%d\":{\"state\":{\"on\":%s,\"bri\":%d,\"hue\":0,\"sat\":0,\"effect\":\"none\",\"xy\":[0,0],\"ct\":0,\"alert\":\"none\",\"colormode\":\"hs\",\"reachable\":true},\"type\":\"%s\",\"name\":\"%s\",\"modelid\":\"LWB010\",\"manufacturername\":\"Philips\",\"uniqueid\":\"%s\",\"swversion\":\"1.0.0\"}",
					   i + 1,
					   g_devices[i].state ? "true" : "false",
					   g_devices[i].brightness,
					   g_devices[i].type == ALEXA_DEVICE_DIMMABLE ? "Dimmable light" : "On/Off light",
					   g_devices[i].name,
					   g_devices[i].uniqueid);

		if (i < g_device_count - 1)
			ptr += sprintf(ptr, ",");
	}

	ptr += sprintf(ptr, "}}");

	esp01_send_http_response(conn_id, 200, "application/json", response, strlen(response));
	alexa_logln("Liste des périphériques envoyée");
}

// Gestionnaire pour les périphériques
static void alexa_handle_lights(int conn_id, const http_parsed_request_t *request)
{
	// Afficher le chemin complet pour le débogage
	alexa_logln("Chemin de la requête lights: %s", request->path);

	// Si l'URL est exactement "/api/lights" ou "/api/lights/", retourne la liste complète
	if (strcmp(request->path, "/api/lights") == 0 || strcmp(request->path, "/api/lights/") == 0)
	{
		// Réponse avec la liste des périphériques
		char response[1024];
		char *ptr = response;
		ptr += sprintf(ptr, "{");

		for (int i = 0; i < g_device_count; i++)
		{
			ptr += sprintf(ptr, "\"%d\":{\"state\":{\"on\":%s,\"bri\":%d,\"hue\":0,\"sat\":0,\"effect\":\"none\",\"xy\":[0,0],\"ct\":0,\"alert\":\"none\",\"colormode\":\"hs\",\"reachable\":true},\"type\":\"%s\",\"name\":\"%s\",\"modelid\":\"LWB010\",\"manufacturername\":\"Philips\",\"uniqueid\":\"%s\",\"swversion\":\"1.0.0\"}",
						   i + 1,
						   g_devices[i].state ? "true" : "false",
						   g_devices[i].brightness,
						   g_devices[i].type == ALEXA_DEVICE_DIMMABLE ? "Dimmable light" : "On/Off light",
						   g_devices[i].name,
						   g_devices[i].uniqueid);

			if (i < g_device_count - 1)
				ptr += sprintf(ptr, ",");
		}

		ptr += sprintf(ptr, "}");

		esp01_send_http_response(conn_id, 200, "application/json", response, strlen(response));
		alexa_logln("Liste des périphériques envoyée");
		return;
	}

	// Extrait l'ID du périphérique de l'URL
	char device_id_str[8] = {0};
	const char *id_start = strstr(request->path, "/lights/");
	if (id_start)
	{
		id_start += 8; // Longueur de "/lights/"
		const char *id_end = strchr(id_start, '/');
		if (id_end)
		{
			strncpy(device_id_str, id_start, id_end - id_start);
		}
		else
		{
			strcpy(device_id_str, id_start);
		}
	}

	alexa_logln("ID du périphérique extrait: %s", device_id_str);

	// Si c'est une requête PUT pour contrôler un périphérique
	if (strcmp(request->method, "PUT") == 0 && strstr(request->path, "/state"))
	{
		alexa_handle_light_control(conn_id, request);
		return;
	}

	// Sinon, renvoie les informations sur le périphérique
	int device_id = atoi(device_id_str) - 1;
	if (device_id >= 0 && device_id < g_device_count)
	{
		alexa_device_t *device = &g_devices[device_id];

		char response[512];
		snprintf(response, sizeof(response),
				 "{\"state\":{\"on\":%s,\"bri\":%d,\"hue\":0,\"sat\":0,\"effect\":\"none\",\"xy\":[0,0],\"ct\":0,\"alert\":\"none\",\"colormode\":\"hs\",\"reachable\":true},\"type\":\"%s\",\"name\":\"%s\",\"modelid\":\"LWB010\",\"manufacturername\":\"Philips\",\"uniqueid\":\"%s\",\"swversion\":\"1.0.0\"}",
				 device->state ? "true" : "false",
				 device->brightness,
				 device->type == ALEXA_DEVICE_DIMMABLE ? "Dimmable light" : "On/Off light",
				 device->name,
				 device->uniqueid);

		esp01_send_http_response(conn_id, 200, "application/json", response, strlen(response));
		alexa_logln("Informations du périphérique %d envoyées", device_id);
	}
	else
	{
		esp01_send_http_response(conn_id, 404, "application/json", "{\"error\":\"Device not found\"}", 26);
		alexa_logln("Périphérique %d non trouvé", device_id);
	}
}

// Gestionnaire pour le contrôle des périphériques
static void alexa_handle_light_control(int conn_id, const http_parsed_request_t *request)
{
	alexa_logln("=== CONTRÔLE PÉRIPHÉRIQUE ===");
	alexa_logln("Chemin: %s", request->path);
	alexa_logln("Méthode: %s", request->method);
	alexa_logln("Body: %s", request->headers_buf);

	// Extrait l'ID du périphérique de l'URL
	char device_id_str[8] = {0};
	const char *id_start = strstr(request->path, "/lights/");
	if (id_start)
	{
		id_start += 8; // Longueur de "/lights/"
		const char *id_end = strchr(id_start, '/');
		if (id_end)
		{
			strncpy(device_id_str, id_start, id_end - id_start);
		}
		else
		{
			strcpy(device_id_str, id_start);
		}
	}

	alexa_logln("ID extrait: %s", device_id_str);

	int device_id = atoi(device_id_str) - 1;
	if (device_id < 0 || device_id >= g_device_count)
	{
		esp01_send_http_response(conn_id, 404, "application/json", "{\"error\":\"Device not found\"}", 26);
		alexa_logln("Périphérique %d non trouvé", device_id);
		return;
	}

	// Variables pour le nouvel état
	uint8_t new_state = g_devices[device_id].state;
	uint8_t new_brightness = g_devices[device_id].brightness;
	uint8_t state_changed = 0;
	uint8_t brightness_changed = 0;

	// Recherche de la commande ON/OFF dans le body avec différents formats possibles
	if (strstr(request->headers_buf, "\"on\":true") ||
		strstr(request->headers_buf, "{\"on\":true}"))
	{
		new_state = 1;
		state_changed = 1;
		alexa_logln("Commande ON détectée");
	}
	else if (strstr(request->headers_buf, "\"on\":false") ||
			 strstr(request->headers_buf, "{\"on\":false}"))
	{
		new_state = 0;
		state_changed = 1;
		alexa_logln("Commande OFF détectée");
	}

	// Recherche d'une commande de luminosité
	const char *bri_start = strstr(request->headers_buf, "\"bri\":");
	if (bri_start && g_devices[device_id].type == ALEXA_DEVICE_DIMMABLE)
	{
		bri_start += 6; // Longueur de "\"bri\":"
		new_brightness = (uint8_t)atoi(bri_start);
		brightness_changed = 1;

		// Si la luminosité est > 0, on s'assure que l'état est ON
		if (new_brightness > 0)
		{
			new_state = 1;
			state_changed = 1;
		}

		alexa_logln("Commande de luminosité détectée: %d", new_brightness);
	}

	// Mettre à jour l'état du périphérique
	alexa_logln("Mise à jour: device_id=%d, state=%d->%d, brightness=%d->%d",
				device_id, g_devices[device_id].state, new_state,
				g_devices[device_id].brightness, new_brightness);

	alexa_update_device_state(device_id, new_state, new_brightness);

