weedmanu/STM32_Libraries/STM32_WifiESP_Alexa/STM32_Alexa.c
	// CORRIGÉ: Générer une réponse JSON correcte
	char response[512];
	char *ptr = response;
	ptr += sprintf(ptr, "[");

	if (state_changed)
	{
		ptr += sprintf(ptr, "{\"success\":{\"/lights/%d/state/on\":%s}}",
					   device_id + 1, new_state ? "true" : "false");
	}

	if (brightness_changed)
	{
		if (state_changed)
			ptr += sprintf(ptr, ",");
		ptr += sprintf(ptr, "{\"success\":{\"/lights/%d/state/bri\":%d}}",
					   device_id + 1, new_brightness);
	}

	ptr += sprintf(ptr, "]");

	esp01_send_http_response(conn_id, 200, "application/json", response, strlen(response));
	alexa_logln("Réponse de contrôle envoyée: %s", response);
}

// Met à jour l'état d'un périphérique
static void alexa_update_device_state(int device_id, uint8_t state, uint8_t brightness)
{
	if (device_id < 0 || device_id >= g_device_count)
		return;

	alexa_device_t *device = &g_devices[device_id];
	device->state = state;
	device->brightness = brightness;

	// Applique l'état au périphérique physique
	if (device->type == ALEXA_DEVICE_ONOFF)
	{
		// Contrôle GPIO
		HAL_GPIO_WritePin(device->gpio_port, device->gpio_pin,
						  state ? GPIO_PIN_SET : GPIO_PIN_RESET);

		alexa_logln("Périphérique %s (%d) mis à %s",
					device->name, device_id, state ? "ON" : "OFF");
	}
	else if (device->type == ALEXA_DEVICE_DIMMABLE)
	{
		// Contrôle PWM
		if (state == 0)
		{
			// Éteint
			__HAL_TIM_SET_COMPARE(device->htim, device->channel, 0);
			alexa_logln("Périphérique %s (%d) éteint", device->name, device_id);
		}
		else
		{
			// Calcule la valeur PWM (0-100%) basée sur la luminosité (0-255)
			uint32_t period = __HAL_TIM_GET_AUTORELOAD(device->htim);
			uint32_t pulse = (period * brightness) / 255;
			__HAL_TIM_SET_COMPARE(device->htim, device->channel, pulse);

			alexa_logln("Périphérique %s (%d) réglé à %d%%",
						device->name, device_id, (brightness * 100) / 255);
		}
	}
}

// Trouve un périphérique par son ID
static int alexa_find_device_by_id(const char *id)
{
	for (int i = 0; i < g_device_count; i++)
	{
		if (strcmp(g_devices[i].uniqueid, id) == 0)
			return i;
	}
	return -1;
}

// Fonction publique pour la découverte
void alexa_handle_discovery(void)
{
	alexa_logln("Envoi d'une annonce de découverte SSDP");

	// Mise à jour du temps de la dernière annonce
	g_last_discovery_time = HAL_GetTick();
	
	// Envoyer les notifications SSDP
	alexa_send_ssdp_notify();
}

// Fonction pour envoyer les notifications SSDP
void alexa_send_ssdp_notify(void)
{
	char buffer[512];
	
	// Message SSDP pour Alexa (format Wemo - rootdevice)
	const char *ssdp_msg1 =
		"NOTIFY * HTTP/1.1\r\n"
		"HOST: 239.255.255.250:1900\r\n"
		"CACHE-CONTROL: max-age=86400\r\n"
		"LOCATION: http://%s:%d/description.xml\r\n"
		"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
		"NT: upnp:rootdevice\r\n"
		"NTS: ssdp:alive\r\n"
		"USN: uuid:Socket-1_0-%s::upnp:rootdevice\r\n\r\n";

	snprintf(buffer, sizeof(buffer), ssdp_msg1, g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
	esp01_send_udp_broadcast(1900, buffer, strlen(buffer));
	HAL_Delay(50);

	// Message SSDP pour Alexa (format Wemo - device)
	const char *ssdp_msg2 =
		"NOTIFY * HTTP/1.1\r\n"
		"HOST: 239.255.255.250:1900\r\n"
		"CACHE-CONTROL: max-age=86400\r\n"
		"LOCATION: http://%s:%d/description.xml\r\n"
		"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
		"NT: urn:Belkin:device:**\r\n"
		"NTS: ssdp:alive\r\n"
		"USN: uuid:Socket-1_0-%s::urn:Belkin:device:**\r\n\r\n";

	snprintf(buffer, sizeof(buffer), ssdp_msg2, g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
	esp01_send_udp_broadcast(1900, buffer, strlen(buffer));
	HAL_Delay(50);
	
	// Message SSDP pour Alexa (format Wemo - UUID)
	const char *ssdp_msg3 =
		"NOTIFY * HTTP/1.1\r\n"
		"HOST: 239.255.255.250:1900\r\n"
		"CACHE-CONTROL: max-age=86400\r\n"
		"LOCATION: http://%s:%d/description.xml\r\n"
		"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
		"NT: uuid:Socket-1_0-%s\r\n"
		"NTS: ssdp:alive\r\n"
		"USN: uuid:Socket-1_0-%s\r\n\r\n";

	snprintf(buffer, sizeof(buffer), ssdp_msg3, g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid, g_devices[0].uniqueid);
	esp01_send_udp_broadcast(1900, buffer, strlen(buffer));
	HAL_Delay(50);
	
	// Message SSDP pour Alexa (format Wemo - basicevent)
	const char *ssdp_msg4 =
		"NOTIFY * HTTP/1.1\r\n"
		"HOST: 239.255.255.250:1900\r\n"
		"CACHE-CONTROL: max-age=86400\r\n"
		"LOCATION: http://%s:%d/description.xml\r\n"
		"SERVER: Unspecified, UPnP/1.0, Unspecified\r\n"
		"NT: urn:Belkin:service:basicevent:1\r\n"
		"NTS: ssdp:alive\r\n"
		"USN: uuid:Socket-1_0-%s::urn:Belkin:service:basicevent:1\r\n\r\n";

	snprintf(buffer, sizeof(buffer), ssdp_msg4, g_device_ip, ALEXA_HTTP_PORT, g_devices[0].uniqueid);
	esp01_send_udp_broadcast(1900, buffer, strlen(buffer));
}
